export const schedule = [
    {
        name: '池下',
        next: '今池',
        line: '東山線（高畑行）',
        time: [3,8,13,18,23,28,33,38,43,48,53,58]
    },
    {
        name: '今池',
        next: '千種',
        line: '東山線（高畑行）',
        time: [4,9,14,19,24,29,34,39,44,49,54,59]
    },
    {
        name: '千種',
        next: '新栄町',
        line: '東山線（高畑行）',
        time: [1,6,11,16,21,26,31,36,41,46,51,56]
    },
    {
        name: '新栄町',
        next: '栄',
        line: '東山線（高畑行）',
        time: [3,8,13,18,23,28,33,38,43,48,53,58]
    },
    {
        name: '栄',
        next: '伏見',
        line: '東山線（高畑行）',
        time: [0,5,10,15,20,25,30,35,40,45,50,55]
    },
    {
        name: '伏見',
        next: '名古屋',
        line: '東山線（高畑行）',
        time: [2,7,12,17,22,27,32,37,42,47,52,57]
    },
    {
        name: '名古屋',
        next: '亀島',
        line: '東山線（高畑行）',
        time: [0,5,10,15,20,25,30,35,40,45,50,55]
    },
    {
        name: '亀島',
        next: null,
        line: '東山線（高畑行）',
        time: []
    },

    {
        name: '亀島',
        next: '名古屋',
        line: '東山線（藤が丘行）',
        time: [4,9,14,19,24,29,34,39,44,49,54,59]
    },
    {
        name: '名古屋',
        next: '伏見',
        line: '東山線（藤が丘行）',
        time: [1,6,11,16,21,26,31,36,41,46,51,56]
    },
    {
        name: '伏見',
        next: '栄',
        line: '東山線（藤が丘行）',
        time: [4,9,14,19,24,29,34,39,44,49,54,59]
    },
    {
        name: '栄',
        next: '新栄町',
        line: '東山線（藤が丘行）',
        time: [1,6,11,16,21,26,31,36,41,46,51,56]
    },
    {
        name: '新栄町',
        next: '千種',
        line: '東山線（藤が丘行）',
        time: [3,8,13,18,23,28,33,38,43,48,53,58]
    },
    {
        name: '千種',
        next: '今池',
        line: '東山線（藤が丘行）',
        time: [0,5,10,15,20,25,30,35,40,45,50,55]
    },
    {
        name: '今池',
        next: '池下',
        line: '東山線（藤が丘行）',
        time: [2,7,12,17,22,27,32,37,42,47,52,57]
    },
    {
        name: '池下',
        next: null,
        line: '東山線（藤が丘行）',
        time: []
    },

    {
        name: '桜山',
        next: '御器所',
        line: '桜通線（中村区役所行）',
        time: [5,15,25,35,45,55]
    },
    {
        name: '御器所',
        next: '吹上',
        line: '桜通線（中村区役所行）',
        time: [6,16,26,36,46,56]
    },
    {
        name: '吹上',
        next: '今池',
        line: '桜通線（中村区役所行）',
        time: [8,18,28,38,48,58]
    },
    {
        name: '今池',
        next: '車道',
        line: '桜通線（中村区役所行）',
        time: [0,10,20,30,40,50]
    },
    {
        name: '車道',
        next: '高岳',
        line: '桜通線（中村区役所行）',
        time: [2,12,22,32,42,52]
    },
    {
        name: '高岳',
        next: '久屋大通',
        line: '桜通線（中村区役所行）',
        time: [4,14,24,34,44,54]
    },
    {
        name: '久屋大通',
        next: '丸の内',
        line: '桜通線（中村区役所行）',
        time: [6,16,26,36,46,56]
    },
    {
        name: '丸の内',
        next: '国際センター',
        line: '桜通線（中村区役所行）',
        time: [8,18,28,38,48,58]
    },
    {
        name: '国際センター',
        next: '名古屋',
        line: '桜通線（中村区役所行）',
        time: [0,10,20,30,40,50]
    },
    {
        name: '名古屋',
        next: '中村区役所',
        line: '桜通線（中村区役所行）',
        time: [1,11,21,31,41,51]
    },
    {
        name: '中村区役所',
        next: null,
        line: '桜通線（中村区役所行）',
        time: []
    },

    {
        name: '中村区役所',
        next: '名古屋',
        line: '桜通線（徳重行）',
        time: [0,10,20,30,40,50]
    },
    {
        name: '名古屋',
        next: '国際センター',
        line: '桜通線（徳重行）',
        time: [2,12,22,32,42,52]
    },
    {
        name: '国際センター',
        next: '丸の内',
        line: '桜通線（徳重行）',
        time: [3,13,23,33,43,53]
    },
    {
        name: '丸の内',
        next: '久屋大通',
        line: '桜通線（徳重行）',
        time: [5,15,25,35,45,55]
    },
    {
        name: '久屋大通',
        next: '高岳',
        line: '桜通線（徳重行）',
        time: [7,17,27,37,47,57]
    },
    {
        name: '高岳',
        next: '車道',
        line: '桜通線（徳重行）',
        time: [8,18,28,38,48,58]
    },
    {
        name: '車道',
        next: '今池',
        line: '桜通線（徳重行）',
        time: [0,10,20,30,40,50]
    },
    {
        name: '今池',
        next: '吹上',
        line: '桜通線（徳重行）',
        time: [3,13,23,33,43,53]
    },
    {
        name: '吹上',
        next: '御器所',
        line: '桜通線（徳重行）',
        time: [5,15,25,35,45,55]
    },
    {
        name: '御器所',
        next: '桜山',
        line: '桜通線（徳重行）',
        time: [7,17,27,37,47,57]
    },
    {
        name: '桜山',
        next: null,
        line: '桜通線（徳重行）',
        time: []
    },

    {
        name: '川名',
        next: '御器所',
        line: '鶴舞線（上小田井行）',
        time: [8,18,28,38,48,58]
    },
    {
        name: '御器所',
        next: '荒畑',
        line: '鶴舞線（上小田井行）',
        time: [0,10,20,30,40,50]
    },
    {
        name: '荒畑',
        next: '鶴舞',
        line: '鶴舞線（上小田井行）',
        time: [2,12,22,32,42,52]
    },
    {
        name: '鶴舞',
        next: '上前津',
        line: '鶴舞線（上小田井行）',
        time: [5,15,25,35,45,55]
    },
    {
        name: '上前津',
        next: '大須観音',
        line: '鶴舞線（上小田井行）',
        time: [7,17,27,37,47,57]
    },
    {
        name: '大須観音',
        next: '伏見',
        line: '鶴舞線（上小田井行）',
        time: [9,19,29,39,49,59]
    },
    {
        name: '伏見',
        next: '丸の内',
        line: '鶴舞線（上小田井行）',
        time: [1,11,21,31,41,51]
    },
    {
        name: '丸の内',
        next: '浅間町',
        line: '鶴舞線（上小田井行）',
        time: [2,12,22,32,42,52]
    },
    {
        name: '浅間町',
        next: null,
        line: '鶴舞線（上小田井行）',
        time: []
    },

    {
        name: '浅間町',
        next: '丸の内',
        line: '鶴舞線（赤池行）',
        time: [9,19,29,39,49,59]
    },
    {
        name: '丸の内',
        next: '伏見',
        line: '鶴舞線（赤池行）',
        time: [1,11,21,31,41,51]
    },
    {
        name: '伏見',
        next: '大須観音',
        line: '鶴舞線（赤池行）',
        time: [3,13,23,33,43,53]
    },
    {
        name: '大須観音',
        next: '上前津',
        line: '鶴舞線（赤池行）',
        time: [5,15,25,35,45,55]
    },
    {
        name: '上前津',
        next: '鶴舞',
        line: '鶴舞線（赤池行）',
        time: [7,17,27,37,47,57]
    },
    {
        name: '鶴舞',
        next: '荒畑',
        line: '鶴舞線（赤池行）',
        time: [9,19,29,39,49,59]
    },
    {
        name: '荒畑',
        next: '御器所',
        line: '鶴舞線（赤池行）',
        time: [1,11,21,31,41,51]
    },
    {
        name: '御器所',
        next: '川名',
        line: '鶴舞線（赤池行）',
        time: [3,13,23,33,43,53]
    },
    {
        name: '川名',
        next: null,
        line: '鶴舞線（赤池行）',
        time: []
    },

    {
        name: '市役所',
        next: '久屋大通',
        line: '名城線（左回り）',
        time: [3,8,13,18,23,28,33,38,43,48,53,58]
    },
    {
        name: '久屋大通',
        next: '栄',
        line: '名城線（左回り）',
        time: [0,5,10,15,20,25,30,35,40,45,50,55]
    },
    {
        name: '栄',
        next: '矢場町',
        line: '名城線（左回り）',
        time: [2,7,12,17,22,27,32,37,42,47,52,57]
    },
    {
        name: '矢場町',
        next: '上前津',
        line: '名城線（左回り）',
        time: [4,9,14,19,24,29,34,39,44,49,54,59]
    },
    {
        name: '上前津',
        next: '東別院',
        line: '名城線（左回り）',
        time: [1,6,11,16,21,26,31,36,41,46,51,56]
    },
    {
        name: '東別院',
        next: null,
        line: '名城線（左回り）',
        time: []
    },

    {
        name: '東別院',
        next: '上前津',
        line: '名城線（右回り）',
        time: [1,6,11,16,21,26,31,36,41,46,51,56]
    },
    {
        name: '上前津',
        next: '矢場町',
        line: '名城線（右回り）',
        time: [3,8,13,18,23,28,33,38,43,48,53,58]
    },
    {
        name: '矢場町',
        next: '栄',
        line: '名城線（右回り）',
        time: [0,5,10,15,20,25,30,35,40,45,50,55]
    },
    {
        name: '栄',
        next: '久屋大通',
        line: '名城線（右回り）',
        time: [2,7,12,17,22,27,32,37,42,47,52,57]
    },
    {
        name: '久屋大通',
        next: '市役所',
        line: '名城線（右回り）',
        time: [4,9,14,19,24,29,34,39,44,49,54,59]
    },
    {
        name: '市役所',
        next: null,
        line: '名城線（右回り）',
        time: []
    }


]